app/Controllers/Category.php

SELECT *
FROM `tbl_category`
WHERE `tbl_category`.`category_id` = '3'
UPDATE `tbl_category` SET `category_name` = 'Cryptod', `category_description` = 'rertet'
WHERE `tbl_category`.`category_id` IN ('3')
---
    public function edit($category_id){
        $model = new \App\Models\CategoryModel();
        $data['category'] = $model->find($category_id);

        if ($this->request->getMethod() === 'post') {
            $model = new \App\Models\CategoryModel();

            // get data from form
            $category_name = $this->request->getPost('category_name');
            $category_description = $this->request->getPost('category_description');

            // validate data
            $validation = \Config\Services::validation();
            $validation->setRules([
                'category_name' => 'required',
                'category_description' => 'required',
            ]);

            if ($validation->withRequest($this->request)->run()) {
                // save data to database
                $model->save([
                    'category_id' => $category_id,
                    'category_name' => $category_name,
                    'category_description' => $category_description,
                ]);

                $data['success'] = 'Category has been updated successfully.';
                $data['category'] = $model->find($category_id);