app/Models/CategoryModel.php

    public function all_category(){
        return $this->findAll();
---
SELECT *
FROM `tbl_category`